blog/cs/javascript.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-04-06 Wed 14:42 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>JavaScript</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Chen Hsin-Yi" />
<link rel="stylesheet" type="text/css" href="/blog/css/readtheorg.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<h1 class="title">JavaScript</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">浮點數運算精度問題</a>
<ul>
<li><a href="#orgheadline2">加法的誤差</a></li>
<li><a href="#orgheadline3">減法的誤差</a></li>
<li><a href="#orgheadline4">乘法的誤差</a></li>
<li><a href="#orgheadline5">除法的誤差</a></li>
<li><a href="#orgheadline6">三角函數的誤差</a></li>
<li><a href="#orgheadline7">分配律有時不成立</a></li>
<li><a href="#orgheadline8">四捨五入誤差的影響</a></li>
<li><a href="#orgheadline9">失去精確位數</a></li>
<li><a href="#orgheadline10">參考連結</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">浮點數運算精度問題</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
JavaScript 的 Number 是 64 bit 的雙精度浮點數(<a href="https://zh.wikipedia.org/wiki/IEEE_754">IEEE754</a>)。
</p>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2">加法的誤差</h3>
<div class="outline-text-3" id="text-orgheadline2">
<p>
\(0.1+0.2 \neq 0.3\)
</p>
<div class="org-src-container">

<pre class="src src-js">console.log<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">1</span> + <span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">2</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
0.30000000000000004
</pre>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3">減法的誤差</h3>
<div class="outline-text-3" id="text-orgheadline3">
<p>
\(0.12 - 0.1 \neq 0.02\)
</p>
<div class="org-src-container">

<pre class="src src-js">console.log<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">12</span> - <span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
0.01999999999999999
</pre>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4">乘法的誤差</h3>
<div class="outline-text-3" id="text-orgheadline4">
<p>
\(3.21 \times 3 \neq 9.63\)
</p>
<div class="org-src-container">

<pre class="src src-js">console.log<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">3</span>.<span style="color: #a45bad;">21</span> * <span style="color: #a45bad;">3</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
9.629999999999999
</pre>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5">除法的誤差</h3>
<div class="outline-text-3" id="text-orgheadline5">
<p>
\(0.3 \div 0.1 \neq 3\)
</p>
<div class="org-src-container">

<pre class="src src-js">console.log<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">3</span> / <span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
2.9999999999999996
</pre>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6">三角函數的誤差</h3>
<div class="outline-text-3" id="text-orgheadline6">
<p>
\(\sin(\pi) \neq 0\)
</p>
<div class="org-src-container">

<pre class="src src-js">console.log<span style="color: #4f97d7;">(</span>Math.sin<span style="color: #bc6ec5;">(</span>Math.PI<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
1.2246467991473532e-16
</pre>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7">分配律有時不成立</h3>
<div class="outline-text-3" id="text-orgheadline7">
<p>
\((0.1 + 0.2) \times 5 \neq 0.1 \times 5 + 0.2 \times 5\)
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">a</span> = <span style="color: #4f97d7;">(</span><span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">1</span> + <span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">2</span><span style="color: #4f97d7;">)</span> * <span style="color: #a45bad;">5</span>;
<span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">b</span> = <span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">1</span> * <span style="color: #a45bad;">5</span> + <span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">2</span> * <span style="color: #a45bad;">5</span>;
console.log<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'(0.1 + 0.2) * 5 = '</span> + a<span style="color: #4f97d7;">)</span>;
console.log<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'0.1 * 5 + 0.2 * 5 = '</span> + b<span style="color: #4f97d7;">)</span>;
</pre>
</div>

<pre class="example">
(0.1 + 0.2) * 5 = 1.5000000000000002
0.1 * 5 + 0.2 * 5 = 1.5
</pre>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8">四捨五入誤差的影響</h3>
<div class="outline-text-3" id="text-orgheadline8">
<p>
多跑了一次回圈，因為預期最後一次結果是3，結果得到1.9999999999999998。
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">start</span> = <span style="color: #a45bad;">1</span>;
<span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">end</span> = <span style="color: #a45bad;">2</span>;
<span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">x</span>, <span style="color: #7590db;">h</span>;

h = <span style="color: #4f97d7;">(</span>end-start<span style="color: #4f97d7;">)</span>/<span style="color: #a45bad;">3</span>
x = start;
console.log<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"x="</span>,x<span style="color: #4f97d7;">)</span>;
<span style="color: #4f97d7; font-weight: bold;">while</span><span style="color: #4f97d7;">(</span>x&lt;end<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  x=x+h;
  console.log<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"x="</span>,x<span style="color: #bc6ec5;">)</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<pre class="example">
x= 1
x= 1.3333333333333333
x= 1.6666666666666665
x= 1.9999999999999998
x= 2.333333333333333
</pre>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9">失去精確位數</h3>
<div class="outline-text-3" id="text-orgheadline9">
<p>
太相近的數值相減的結果完全不可信
</p>

<p>
\(3.141592653589793\) - \(3.141592653585682 \neq 0.000000000004111\)
</p>
<div class="org-src-container">

<pre class="src src-js"><span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">x</span> = <span style="color: #a45bad;">3</span>.<span style="color: #a45bad;">141592653589793</span>;
<span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">y</span> = <span style="color: #a45bad;">3</span>.<span style="color: #a45bad;">141592653585682</span>;
<span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">z</span> = x - y;
console.log<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"x - y = "</span>, z<span style="color: #4f97d7;">)</span>;
</pre>
</div>

<pre class="example">
x - y =  4.11093381558203e-12
</pre>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10">參考連結</h3>
<div class="outline-text-3" id="text-orgheadline10">
<ul class="org-ul">
<li><a href="http://blog.chewxy.com/2014/02/24/what-every-javascript-developer-should-know-about-floating-point-numbers/">What Every JavaScript Developer Should Know About Floating Point Numbers</a>, chewxy, 2014</li>
<li><a href="http://blog.dcview.com/article.php?a=VmhQNVY+Czo=">使用浮點數最最基本的觀念</a>, 洗鏡光, 2008</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Chen Hsin-Yi</p>
<p class="date">Created: 2016-04-06 Wed 14:42</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
